
sys_config_data = [
    # 华北地区
    (101, 'source', 'beijing',      '北京',   '{"x":116.4551,"y":40.2539}'),
    (102, 'source', 'tianjin',      '天津',   '{"x":117.4219,"y":39.4189}'),
    (103, 'source', 'hebei',        '河北',   '{"x":115.4004,"y":37.9688}'),
    (104, 'source', 'shanxi',       '山西',   '{"x":112.4121,"y":37.6611}'),
    (105, 'source', 'neimenggu',    '内蒙古', '{"x":117.5977,"y":44.3408}'),
    # 东北地区
    (111, 'source', 'liaoning',     '辽宁',   '{"x":122.3438,"y":41.0889}'),
    (112, 'source', 'jilin',        '吉林',   '{"x":126.4746,"y":43.5938}'),
    (113, 'source', 'heilongjiang', '黑龙江', '{"x":128.1445,"y":48.5156}'),
    # 西北地区 (宁夏、新疆、青海、陕西、甘肃)
    (121, 'source', 'ningxia',      '宁夏',   '{"x":105.9961,"y":37.3096}'),
    (123, 'source', 'qinghai',      '青海',   '{"x":96.2402,"y":35.4199}'),
    (124, 'source', 'shaanxi',      '陕西',   '{"x":109.5996,"y":35.6396}'),
    (125, 'source', 'gansu',        '甘肃',   '{"x":95.7129,"y":40.166}'),
    # 华中地区
    (131, 'source', 'hubei',        '湖北',   '{"x":112.2363,"y":31.1572}'),
    (132, 'source', 'hunan',        '湖南',   '{"x":111.5332,"y":27.3779}'),
    (133, 'source', 'henan',        '河南',   '{"x":113.4668,"y":33.8818}'),
    (134, 'source', 'jiangxi',      '江西',   '{"x":116.0156,"y":27.29}'),
    # 华东地区
    (141, 'source', 'shandong',     '山东',   '{"x":118.7402,"y":36.4307}'),
    (142, 'source', 'jiangsu',      '江苏',   '{"x":120.0586,"y":32.915}'),
    (143, 'source', 'zhejiang',     '浙江',   '{"x":120.498,"y":29.0918}'),
    (144, 'source', 'shanghai',     '上海',   '{"x":121.4648,"y":31.2891}'),
    (145, 'source', 'anhui',        '安徽',   '{"x":117.2461,"y":32.0361}'),
    (146, 'source', 'fujian',       '福建',   '{"x":118.3008,"y":25.9277}'),
    # 西南地区（四川、云南、贵州、西藏、重庆）；
    (151, 'source', 'sichuan',      '四川',   '{"x":102.9199,"y":30.1904}'),
    (153, 'source', 'guizhou',      '贵州',   '{"x":106.6113,"y":26.9385}'),
    (155, 'source', 'chongqing',    '重庆',   '{"x":107.7539,"y":30.1904}'),
    # 华南地区
    (161, 'source', 'guangdong',    '广东',   '{"x":113.4668,"y":22.8076}'),
    (162, 'source', 'guangxi',      '广西',   '{"x":108.2813,"y":23.6426}'),
    (163, 'source', 'hainan',       '海南',   '{"x":109.9512,"y":19.2041}'),
    # 其他
    (171, 'source', 'other',        '其他',   '{"x":0,"y":0}'),

    # 公告类型
    (201, 'subject', '预公告',   '0', None),
    (202, 'subject', '招标公告', '1', None),
    (203, 'subject', '更正公告', '0', None),
    (204, 'subject', '中标公告', '0', None),
    (205, 'subject', '其他公告', '0', None),


    (301, 'suggest', '工程', '*', None),
    (302, 'suggest', '机械', '*', None)
]
